In [1]:
from connection import connection_string

In [2]:
# 加载 ipython-sql 扩展
%load_ext sql

# 连接到 PostgreSQL 数据库
%sql $connection_string

## 重建数据库

我在windows平台安装的postgresql和pgAdmin，在pgAdmin操作的时候经常显示下面的错误：

```bash
Failed to retrieve data from the server
无效的"UTF8"编码字节顺序：0xc8 0xd5
```

后来使用下面的sql语句，发现datcollate、datctype字段不是utf8格式：

```sql
SELECT datname, encoding, datcollate, datctype FROM pg_database;
```

使用下面的sql重建数据库解决问题

```sql
CREATE DATABASE tysql
WITH ENCODING='UTF8'
LC_COLLATE='en_US.UTF-8'
LC_CTYPE='en_US.UTF-8'
TEMPLATE=template0;
```

# 查询

## 简单查询

In [4]:
%%time
%%sql

select prod_name
from products

 * postgresql://postgres:***@localhost:5432/tysql
9 rows affected.
CPU times: total: 31.2 ms
Wall time: 22.8 ms

[('8 inch teddy bear                                                                                                                                                                                                                                              ',),
 ('12 inch teddy bear                                                                                                                                                                                                                                             ',),
 ('18 inch teddy bear                                                                                                                                                                                                                                             ',),
 ('Fish bean bag toy                                                                                                                                                                                                                                              ',),
 ('Bird bean bag toy                                                                                                                                                                                                                                              ',),
 ('Rabbit bean bag toy                                                                                                                                                                                                                                            ',),
 ('Raggedy Ann                                                                                                                                                                                                                                                    ',),
 ('King doll                                                                                                                                                                                                                                                      ',),
 ('Queen doll                                                                                                                                                                                                                                                     ',)]

## distinct

In [64]:
%%sql

select distinct prod_id from orderitems

 * postgresql://postgres:***@localhost:5432/tysql
7 rows affected.

[('BNBG01    ',),
 ('BNBG03    ',),
 ('BNBG02    ',),
 ('BR03      ',),
 ('BR01      ',),
 ('RGAN01    ',),
 ('BR02      ',)]

sql语句不区分大小写

## 分页查询

In [5]:
%%sql

select prod_name
from products
limit 5

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('8 inch teddy bear                                                                                                                                                                                                                                              ',),
 ('12 inch teddy bear                                                                                                                                                                                                                                             ',),
 ('18 inch teddy bear                                                                                                                                                                                                                                             ',),
 ('Fish bean bag toy                                                                                                                                                                                                                                              ',),
 ('Bird bean bag toy                                                                                                                                                                                                                                              ',)]

In [6]:
%%sql

select prod_name
from products
limit 5 offset 5

 * postgresql://postgres:***@localhost:5432/tysql
4 rows affected.

[('Rabbit bean bag toy                                                                                                                                                                                                                                            ',),
 ('Raggedy Ann                                                                                                                                                                                                                                                    ',),
 ('King doll                                                                                                                                                                                                                                                      ',),
 ('Queen doll                                                                                                                                                                                                                                                     ',)]

行的序号从0开始，limit 1 offset 0是第1行（也可以称为第0行）

## 注释的写法

In [7]:
%%sql

/*
多行注释
*/

select prod_name -- 单行注释
from products
limit 5 offset 5

 * postgresql://postgres:***@localhost:5432/tysql
4 rows affected.

[('Rabbit bean bag toy                                                                                                                                                                                                                                            ',),
 ('Raggedy Ann                                                                                                                                                                                                                                                    ',),
 ('King doll                                                                                                                                                                                                                                                      ',),
 ('Queen doll                                                                                                                                                                                                                                                     ',)]

## 排序

In [14]:
%%sql

select cust_name from customers order by cust_name desc;

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('Village Toys                                      ',),
 ('The Toy Store                                     ',),
 ('Kids Place                                        ',),
 ('Fun4All                                           ',),
 ('Fun4All                                           ',)]

In [22]:
%%sql

select cust_id, order_num, order_date from orders order by cust_id, order_date desc -- order by 可以接多个列，用逗号分隔

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('1000000001', 20005, datetime.date(2020, 5, 1)),
 ('1000000001', 20009, datetime.date(2020, 2, 8)),
 ('1000000003', 20006, datetime.date(2020, 1, 12)),
 ('1000000004', 20007, datetime.date(2020, 1, 30)),
 ('1000000005', 20008, datetime.date(2020, 2, 3))]

In [24]:
%%sql

select quantity, item_price from OrderItems order by quantity desc, item_price desc -- desc指定倒序排列，哪个排序字段倒叙，放到哪个字段后面

 * postgresql://postgres:***@localhost:5432/tysql
18 rows affected.

[(250, Decimal('2.49')),
 (250, Decimal('2.49')),
 (250, Decimal('2.49')),
 (100, Decimal('10.99')),
 (100, Decimal('5.49')),
 (100, Decimal('2.99')),
 (100, Decimal('2.99')),
 (100, Decimal('2.99')),
 (50, Decimal('11.49')),
 (50, Decimal('4.49')),
 (20, Decimal('5.99')),
 (10, Decimal('11.99')),
 (10, Decimal('8.99')),
 (10, Decimal('3.49')),
 (10, Decimal('3.49')),
 (10, Decimal('3.49')),
 (5, Decimal('11.99')),
 (5, Decimal('4.99'))]

## 过滤

In [49]:
%%sql
SELECT prod_name, prod_price
FROM Products
WHERE prod_price = 3.49
ORDER BY prod_name -- 注意order by 和 where 的位置关系
limit 1 offset 3

 * postgresql://postgres:***@localhost:5432/tysql
0 rows affected.

[]

In [8]:
%%sql
SELECT vend_id, prod_name
FROM Products
WHERE vend_id <> 'DLL01';

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('BRS01     ', '8 inch teddy bear                                                                                                                                                                                                                                              '),
 ('BRS01     ', '12 inch teddy bear                                                                                                                                                                                                                                             '),
 ('BRS01     ', '18 inch teddy bear                                                                                                                                                                                                                                             '),
 ('FNG01     ', 'King doll                                                                                                                                                                                                                                                      '),
 ('FNG01     ', 'Queen doll                                                                                                                                                                                                                                                     ')]

In [9]:
%%sql
SELECT vend_id, prod_name
FROM Products
WHERE vend_id != 'DLL01';

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('BRS01     ', '8 inch teddy bear                                                                                                                                                                                                                                              '),
 ('BRS01     ', '12 inch teddy bear                                                                                                                                                                                                                                             '),
 ('BRS01     ', '18 inch teddy bear                                                                                                                                                                                                                                             '),
 ('FNG01     ', 'King doll                                                                                                                                                                                                                                                      '),
 ('FNG01     ', 'Queen doll                                                                                                                                                                                                                                                     ')]

In [10]:
%%sql
SELECT prod_name, prod_price
FROM Products
WHERE prod_price BETWEEN 5 AND 10;

 * postgresql://postgres:***@localhost:5432/tysql
4 rows affected.

[('8 inch teddy bear                                                                                                                                                                                                                                              ', Decimal('5.99')),
 ('12 inch teddy bear                                                                                                                                                                                                                                             ', Decimal('8.99')),
 ('King doll                                                                                                                                                                                                                                                      ', Decimal('9.49')),
 ('Queen doll                                                                                                                                                                                                                                                     ', Decimal('9.49'))]

In [12]:
%%sql
SELECT cust_name
FROM Customers
WHERE cust_email IS NULL;

 * postgresql://postgres:***@localhost:5432/tysql
2 rows affected.

[('Kids Place                                        ',),
 ('The Toy Store                                     ',)]

In [17]:
%%sql
select prod_id, prod_name
from products
where prod_price=9.49

 * postgresql://postgres:***@localhost:5432/tysql
2 rows affected.

[('RYL01     ', 'King doll                                                                                                                                                                                                                                                      '),
 ('RYL02     ', 'Queen doll                                                                                                                                                                                                                                                     ')]

In [20]:
%%sql
select prod_id, prod_name
from products
where prod_price >= 9

 * postgresql://postgres:***@localhost:5432/tysql
3 rows affected.

[('BR03      ', '18 inch teddy bear                                                                                                                                                                                                                                             '),
 ('RYL01     ', 'King doll                                                                                                                                                                                                                                                      '),
 ('RYL02     ', 'Queen doll                                                                                                                                                                                                                                                     ')]

In [29]:
%%sql
select distinct order_num from orderitems
where quantity >= 100
order by order_num

 * postgresql://postgres:***@localhost:5432/tysql
3 rows affected.

[(20005,), (20007,), (20009,)]

In [34]:
%%sql
select order_num -- , sum(quantity) as sum_quantity
from orderitems
group by order_num
having sum(quantity) >= 100 -- 需要使用having子句，且只能使用原表字段，比如不能直接使用sum_quantity
order by order_num

 * postgresql://postgres:***@localhost:5432/tysql
3 rows affected.

[(20005,), (20007,), (20009,)]

In [36]:
%%sql

select prod_name, prod_price
from products
where prod_price between 3 and 6
order by prod_price

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('Fish bean bag toy                                                                                                                                                                                                                                              ', Decimal('3.49')),
 ('Bird bean bag toy                                                                                                                                                                                                                                              ', Decimal('3.49')),
 ('Rabbit bean bag toy                                                                                                                                                                                                                                            ', Decimal('3.49')),
 ('Raggedy Ann                                                                                                                                                                                                                                                    ', Decimal('4.99')),
 ('8 inch teddy bear                                                                                                                                                                                                                                              ', Decimal('5.99'))]

In [53]:
%%sql
SELECT vend_id, prod_name
FROM Products
WHERE NOT vend_id = 'DLL01'
ORDER BY prod_name;

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('BRS01     ', '12 inch teddy bear                                                                                                                                                                                                                                             '),
 ('BRS01     ', '18 inch teddy bear                                                                                                                                                                                                                                             '),
 ('BRS01     ', '8 inch teddy bear                                                                                                                                                                                                                                              '),
 ('FNG01     ', 'King doll                                                                                                                                                                                                                                                      '),
 ('FNG01     ', 'Queen doll                                                                                                                                                                                                                                                     ')]

In [55]:
%%sql
select * from Vendors where vend_country='USA' and vend_state='CA'

 * postgresql://postgres:***@localhost:5432/tysql
1 rows affected.

[('DLL01     ', 'Doll House Inc.                                   ', '555 High Street                                   ', 'Dollsville                                        ', 'CA   ', '99999     ', 'USA                                               ')]

In [59]:
%%sql
select * from OrderItems
where prod_id in ('BR01', 'BR02', 'BR03') and quantity >= 100

 * postgresql://postgres:***@localhost:5432/tysql
2 rows affected.

[(20005, 1, 'BR01      ', 100, Decimal('5.49')),
 (20005, 2, 'BR03      ', 100, Decimal('10.99'))]

In [61]:
%%sql

select * from products
where prod_price >= 3 and prod_price <=6
order by prod_price

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('BNBG01    ', 'DLL01     ', 'Fish bean bag toy                                                                                                                                                                                                                                              ', Decimal('3.49'), 'Fish bean bag toy, complete with bean bag worms with which to feed it'),
 ('BNBG02    ', 'DLL01     ', 'Bird bean bag toy                                                                                                                                                                                                                                              ', Decimal('3.49'), 'Bird bean bag toy, eggs are not included'),
 ('BNBG03    ', 'DLL01     ', 'Rabbit bean bag toy                                                                                                                                                                                                                                            ', Decimal('3.49'), 'Rabbit bean bag toy, comes with bean bag carrots'),
 ('RGAN01    ', 'DLL01     ', 'Raggedy Ann                                                                                                                                                                                                                                                    ', Decimal('4.99'), '18 inch Raggedy Ann doll'),
 ('BR01      ', 'BRS01     ', '8 inch teddy bear                                                                                                                                                                                                                                              ', Decimal('5.99'), '8 inch teddy bear, comes with cap and jacket')]

# 查看数据库schema

In [8]:
%%sql

select *
from pg_catalog.pg_tables
where schemaname not in ('pg_catalog', 'information_schema')

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('public', 'orders', 'postgres', None, True, False, True, False),
 ('public', 'orderitems', 'postgres', None, True, False, True, False),
 ('public', 'products', 'postgres', None, True, False, True, False),
 ('public', 'customers', 'postgres', None, True, False, True, False),
 ('public', 'vendors', 'postgres', None, True, False, True, False)]

In [9]:
%%sql

select column_name, data_type, is_nullable, column_default
from information_schema.columns
where table_name = 'products'

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('prod_price', 'numeric', 'NO', None),
 ('prod_id', 'character', 'NO', None),
 ('vend_id', 'character', 'NO', None),
 ('prod_name', 'character', 'NO', None),
 ('prod_desc', 'character varying', 'YES', None)]